<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of A Better Finder Attributes and creates a package.

The MAJOR_VERSION input variable can be overridden to determine which version of the app is retrieved. The only working MAJOR_VERSION as of this writing is 5, but if version 6 comes out it's conceivable that this recipe may be compatible.</string>
	<key>Identifier</key>
	<string>com.github.homebysix.pkg.ABetterFinderAttributes</string>
	<key>Input</key>
	<dict>
		<key>MAJOR_VERSION</key>
		<string>5</string>
		<key>NAME</key>
		<string>A Better Finder Attributes</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.ABetterFinderAttributes</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Users/Shared</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>net.publicspace.abfa%MAJOR_VERSION%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
